let i = 0;
while (++i < 5) {
    alert(i);
}
// Result: 1, 2, 3, 4


let j = 0;
while (j++ < 5) {
    alert(j);
}
// Result: 1, 2, 3, 4, 5


// Question: Code ทั้งสองจะแสดง alert ออกมาเหมือนกันทั้งหมดหรือไม่
// Answer: แสดงผลลัพธ์ออกมาต่างกัน

// เนื่องจาก Code ชุดที่ 1 ตอนเช็คเงื่อนไขของ while
// จะทำการเพิ่มค่าของ i ไป 1 ก่อนจะทำการเช็คเงื่อนไข
// และจะเอา i ค่านั้นไปทำคำสั่งที่อยู่ใต้ while

// ส่วน Code ชุดที่ 2 ตอนเช็คเงื่อนไขของ while
// จะทำการเช็คเงื่อนไขของ while ก่อน พอเช็คเสร็จก็จะเพิ่มค่าของ i ไป 1
// และจะเอา i ค่านั้นไปทำคำสั่งที่อยู่ใต้ while